{
  "name": "Chenshun Weng",
  "tagline": "Systems Engineer | Robotics | Simulation",
  "hero_description": "Specializing in production automation, robotics, and digital factory planning with experience at leading German manufacturers.",
  "view_projects": "View Projects",
  "contact_me": "Contact Me",
  "scroll_down": "Scroll Down",
  "scroll_to_about": "Scroll to About section",
  "switch_to_light_mode": "Switch to light mode",
  "switch_to_dark_mode": "Switch to dark mode",
  
  "nav_about": "About",
  "nav_projects": "Projects",
  "nav_skills": "Skills",
  "nav_education": "Education",
  "nav_contact": "Contact",
  
  "about_title": "About Me",
  "about_text": "Reliable and goal-oriented engineer in production automation with focus on robotics, MBSE and digital factory planning. Extensive practical experience through industrial projects at BSH Hausgeräte, Volkswagen and BMW. Proficient in the use of simulation and CAD systems as well as in the development of mechatronic systems. Currently looking for a position in Systems Engineering, Robotics or Technical Product Development.",
  
  "professional_philosophy_title": "Professional Philosophy",
  "professional_philosophy_text": "As a Systems Engineer, I strive to tackle complex technical challenges through methodical analysis and innovative solutions. My goal is to develop automation systems that are not only efficient but also sustainable and user-friendly. I believe in the power of interdisciplinary collaboration and continuous learning to drive technological advancement.",
  
  "resume_button": "Download Resume (PDF)",
  "contact_button": "Get in Touch",
  
  "experience_title": "Experience",
  "experience_text": "Over 3 years of hands-on experience in industrial automation projects with leading German manufacturers including BSH, Volkswagen, and BMW.",
  
  "education_title": "Education",
  "education_text": "Dual degree program combining German engineering excellence with international perspective through studies at TU Berlin and Jiangsu University of Technology.",
  
  "skills_title": "Skills",
  "skills_text": "Proficient in robotics programming, simulation tools, CAD systems, and MBSE methodologies with a strong foundation in both mechanical and software engineering.",
  
  "interests_title": "Interests",
  "interests_text": "Passionate about Industry 4.0, collaborative robotics, sustainable manufacturing, and the intersection of AI with traditional engineering disciplines.",
  
  "career_goals_title": "Career Vision & Goals",
  "career_goals_text": "I am committed to advancing the field of automation and robotics through innovative engineering solutions that enhance productivity, sustainability, and human-machine collaboration. My career path is guided by continuous learning and the pursuit of excellence in systems engineering.",
  
  "short_term_goals_title": "Short-term (1-2 years)",
  "short_term_goals_text": "Secure a challenging position as a Systems Engineer or Robotics Specialist where I can apply and expand my technical expertise while contributing to innovative automation solutions.",
  
  "mid_term_goals_title": "Mid-term (3-5 years)",
  "mid_term_goals_text": "Lead technical projects in automation and robotics, develop specialized expertise in AI-enhanced systems, and pursue relevant certifications in project management and systems engineering.",
  
  "long_term_goals_title": "Long-term (5+ years)",
  "long_term_goals_text": "Advance to a senior technical or leadership role where I can influence strategic decisions, mentor junior engineers, and contribute to setting industry standards and best practices.",
  
  "projects_title": "Project Experience",
  "projects_filter_all": "All Projects",
  "projects_filter_professional": "Professional Experience",
  "projects_filter_school": "School Projects",
  
  "skills_simulation_design_title": "Simulation & Design",
  "skills_programming_robotics_title": "Programming & Robotics",
  "skills_mbse_quality_title": "MBSE & Quality Management",
  "skills_languages_title": "Languages",
  "skills_level_proficient": "Proficient",
  "skills_level_advanced": "Advanced",
  "skills_level_intermediate": "Intermediate",
  "skills_level_basic": "Basic",
  "skills_level_fluent": "Fluent",
  "skills_level_native": "Native",
  
  "project_card_details_button": "View Details",
  "project_modal_close_button": "Close",
  "project_modal_tools_label": "Tools & Technologies Used:",
  "project_modal_result_label": "Result:",
  "project_video_unavailable": "Video coming soon",
  "project_video_placeholder_text": "Video Placeholder",
  "project_modal_show_more": "Show More",
  "project_modal_show_less": "Show Less",
  
  "project_sdos_title": "Team Lead – Safe Door Open System (BMW i3)",
  "project_sdos_period": "10/2023 - 03/2024",
  "project_sdos_description": "Development of an intelligent door opening system based on MBSE to increase traffic safety. System architecture design in Cameo Systems Modeler according to SysML standards, incl. sensor, actuator and control components. Requirements management considering functional safety (ASIL, ISO 26262). Coordination of an interdisciplinary project team, interface between mechanics, software and validation.",
  "project_sdos_result": "Collision risk with cyclists reduced by ~60%, probability of incorrect operation reduced by ~30%.",
  "project_sdos_category": "school",
  "project_sdos_challenge": "The main challenge was integrating multiple sensor systems while ensuring real-time performance and meeting strict automotive safety standards (ISO 26262).",
  "project_sdos_solution": "Implemented a modular architecture with redundant safety systems and developed a comprehensive validation framework to ensure reliability under various environmental conditions.",
  "project_sdos_tools": "Cameo Systems Modeler, SysML, MATLAB/Simulink, DOORS for requirements management, Git for version control",
  
  "project_ur10e_title": "CAD Engineer – Development of a Vacuum Connection for UR10e",
  "project_ur10e_period": "10/2023 - 03/2024",
  "project_ur10e_description": "Load-optimized design of a flexible hose connection for integration into a collaborative robot system. CAD-based design of the connection in Fusion 360 & Siemens NX with a focus on weight distribution and ease of assembly. Iterative prototyping with 3D printing and FEM analysis to validate mechanical strength. Interface coordination between robot, gripper and vacuum source.",
  "project_ur10e_result": "Torque load reduced by ~40%, component service life increased by ~25%.",
  "project_ur10e_category": "school",
  "project_ur10e_challenge": "Designing a lightweight yet durable connection that wouldn't interfere with the robot's movement range while maintaining optimal vacuum pressure.",
  "project_ur10e_solution": "Utilized topology optimization techniques and conducted extensive FEM analysis to identify the optimal material distribution. Created a modular design that allowed for easy maintenance and replacement of wear parts.",
  "project_ur10e_tools": "Fusion 360, Siemens NX, ANSYS for FEM analysis, Ultimaker 3D printer for rapid prototyping",
  
  "project_vw_factory_title": "Systems Engineer – Virtual Factory (Volkswagen)",
  "project_vw_factory_period": "04/2023 - 07/2023",
  "project_vw_factory_description": "Digitization and automation of engine production through virtual modeling and process optimization. Modeling and simulation of the production layout with Tecnomatix Plant Simulation for early detection of bottlenecks. Analysis and optimization of material flows and line layouts to reduce cycle times. Application of lean methods for process simplification (e.g., value stream mapping, PDCA).",
  "project_vw_factory_result": "Production capacity increased by ~20%, throughput time reduced by ~30%.",
  "project_vw_factory_category": "school",
  "project_vw_factory_challenge": "Creating an accurate digital twin of the existing production line that could be used for reliable simulation and optimization without disrupting ongoing operations.",
  "project_vw_factory_solution": "Developed a comprehensive data collection methodology and created a modular simulation framework that allowed for incremental validation and implementation of changes.",
  "project_vw_factory_tools": "Tecnomatix Plant Simulation, AutoCAD for layout planning, Microsoft Power BI for data visualization, Lean management tools",
  
  "project_bsh_master_title": "Intern (Master Thesis) – BSH Hausgeräte GmbH",
  "project_bsh_master_period": "10/2024 - PRESENT",
  "project_bsh_master_description": "Development of a fully automated test system for washing machines with >80% coverage of standardized test cases. Visual recognition system based on deep learning to improve error detection and process automation. Design and 3D printing of new robot components to increase system stability (+50%). Execution of extensive load and stress tests to validate the system.",
  "project_bsh_master_result": "Master Thesis: \"Automated Test Systems with Collaborative Robot and Visual AI System\"",
  "project_bsh_master_category": "professional",
  "project_bsh_master_challenge": "Creating a reliable automated testing system that could handle the variability of different washing machine models and accurately detect subtle quality issues.",
  "project_bsh_master_solution": "Implemented a deep learning-based computer vision system trained on thousands of images of both defective and non-defective units. Developed a flexible robot control system that could adapt to different machine geometries.",
  "project_bsh_master_tools": "Python with TensorFlow and OpenCV for AI vision system, Universal Robots programming interface, CAD tools for component design, GitLab CI/CD for continuous integration",
  
  "project_haering_bachelor_title": "Intern (Bachelor Thesis) – Anton Häring KG",
  "project_haering_bachelor_period": "10/2021 - 06/2022",
  "project_haering_bachelor_description": "Development of a modular software framework for different robot systems. Optimization of sequence controls with a reduction in cycle time of ~30%. Development of a system for active collision avoidance (error rate -70%). Scaling to complex production lines as part of series production.",
  "project_haering_bachelor_result": "Bachelor Thesis: \"Development of a Control Concept for Automated Machine Loading\"",
  "project_haering_bachelor_category": "professional",
  "project_haering_bachelor_challenge": "Creating a unified control framework that could work across different robot brands and machine types while maintaining high performance and safety standards.",
  "project_haering_bachelor_solution": "Designed an abstraction layer that standardized the interface between different robot controllers and implemented a real-time collision detection and avoidance system using proximity sensors and predictive algorithms.",
  "project_haering_bachelor_tools": "KUKA Robot Language (KRL), ABB RAPID, Siemens S7 PLC programming, Python for data analysis, AutoCAD for layout planning",
  
  "contact_title": "Contact",
  "contact_email": "Email",
  "contact_phone": "Phone",
  "contact_address": "Address",
  "contact_get_in_touch": "Get in Touch",
  "contact_intro_text": "I am always open to discussing new projects, creative ideas or opportunities to be part of your visions. Feel free to reach out to me.",
  "contact_form_name": "Your Name",
  "contact_form_email": "Your Email",
  "contact_form_message": "Your Message",
  "contact_form_send_button": "Send Message",
  "contact_form_sending": "Sending...",
  "contact_form_sent_success": "Message sent successfully!",
  "contact_form_sent_error": "Failed to send message. Please try again.",
  "contact_phone_value": "+49 176 XXXXXXXX (Please request via email)",
  "contact_address_value": "Berlin, Germany (Full address available upon request)",
  
  "education_msc_degree": "M.Sc. Production Engineering - Automation and Information Technology",
  "education_msc_institution": "Technical University of Berlin",
  "education_msc_period": "04/2022 - 06/2025 (Expected)",
  "education_msc_focus": "Focus: Industrial Virtual Engineering, Digital Factory Operations, Virtual Product Creation Technologies",
  "education_msc_thesis": "Thesis: Automation of Washing Machine Testing using Collaborative Robots and Deep Learning-based Visual Recognition",
  
  "education_beng_mechatronics_degree": "B.Eng. Mechatronics (Dual Degree)",
  "education_beng_mechatronics_institution": "Merseburg University of Applied Sciences, Germany",
  "education_beng_mechatronics_period": "10/2020 - 09/2022",
  "education_beng_mechatronics_focus": "Focus: Robotics, Electric Motors and Drive Technology, Mechanical Systems, Microprocessor Technology, Assembly Technology",
  "education_beng_mechatronics_thesis": "Thesis: Conceptualization of an Industrial Robot Program for Fully Automated Loading and Unloading of Machine Tools",
  
  "education_beng_mechanical_degree": "B.Eng. Mechanical Design, Manufacturing and Automation (Dual Degree)",
  "education_beng_mechanical_institution": "Jiangsu University of Technology, China",
  "education_beng_mechanical_period": "09/2017 - 09/2022",
  "education_beng_mechanical_focus": "Focus: Engineering Mechanics, Mechanical Design, Control Technology Fundamentals, Engineering Drawing, Material Processing Technology",
  "education_beng_mechanical_honors": "Honors/Certificates: German Engineer Professional Certificate, Multiple University Scholarships",
  "education_focus_label": "Focus Areas:",
  "education_thesis_label": "Thesis:",
  "education_honors_label": "Honors/Certificates:",
  
  "footer_copyright": "© 2025 Chenshun Weng. All rights reserved.",
  "footer_built_with": "Built with React & Tailwind CSS"
}
