{
  "name": "Chenshun Weng",
  "tagline": "Systems Engineer | Robotik | Simulation",
  "hero_description": "Spezialisiert auf Produktionsautomatisierung, Robotik und digitale Fabrikplanung mit Erfahrung bei führenden deutschen Herstellern.",
  "view_projects": "Projekte ansehen",
  "contact_me": "Kontakt aufnehmen",
  "scroll_down": "Nach unten scrollen",
  "scroll_to_about": "Zum Bereich Über mich scrollen",
  "switch_to_light_mode": "Zum hellen Modus wechseln",
  "switch_to_dark_mode": "Zum dunklen Modus wechseln",
  
  "nav_about": "Über mich",
  "nav_projects": "Projekte",
  "nav_skills": "Kenntnisse",
  "nav_education": "Ausbildung",
  "nav_contact": "Kontakt",
  
  "about_title": "Über mich",
  "about_text": "Zuverlässiger und zielorientierter Ingenieur im Bereich Produktionsautomatisierung mit Schwerpunkten in Robotik, MBSE und digitaler Fabrikplanung. Umfassende Praxiserfahrung durch Industrieprojekte bei BSH Hausgeräte, Volkswagen und BMW. Versiert im Umgang mit Simulations- und CAD-Systemen sowie in der Entwicklung mechatronischer Systeme. Aktuell auf der Suche nach einer Position im Bereich Systems Engineering, Robotik oder technische Produktentwicklung.",
  
  "professional_philosophy_title": "Berufliche Philosophie",
  "professional_philosophy_text": "Als Systemingenieur strebe ich danach, komplexe technische Herausforderungen durch methodische Analyse und innovative Lösungsansätze zu bewältigen. Mein Ziel ist es, Automatisierungssysteme zu entwickeln, die nicht nur effizient, sondern auch nachhaltig und benutzerfreundlich sind. Ich glaube an die Kraft interdisziplinärer Zusammenarbeit und kontinuierlichen Lernens, um den technologischen Fortschritt voranzutreiben.",
  
  "resume_button": "Lebenslauf herunterladen (PDF)",
  "contact_button": "Kontakt aufnehmen",
  
  "experience_title": "Erfahrung",
  "experience_text": "Über 3 Jahre praktische Erfahrung in industriellen Automatisierungsprojekten mit führenden deutschen Herstellern wie BSH, Volkswagen und BMW.",
  
  "education_title": "Ausbildung",
  "education_text": "Duales Studienprogramm, das deutsche Ingenieursexzellenz mit internationaler Perspektive durch Studium an der TU Berlin und der Jiangsu University of Technology verbindet.",
  
  "skills_title": "Kenntnisse",
  "skills_text": "Versiert in Roboterprogrammierung, Simulationswerkzeugen, CAD-Systemen und MBSE-Methoden mit einer soliden Grundlage sowohl in Maschinenbau als auch in Softwareentwicklung.",
  
  "interests_title": "Interessen",
  "interests_text": "Leidenschaftlich interessiert an Industrie 4.0, kollaborativer Robotik, nachhaltiger Fertigung und der Schnittstelle zwischen KI und traditionellen Ingenieursdisziplinen.",
  
  "career_goals_title": "Berufliche Vision & Ziele",
  "career_goals_text": "Ich setze mich für die Weiterentwicklung der Automatisierungs- und Robotiktechnik durch innovative Ingenieurlösungen ein, die Produktivität, Nachhaltigkeit und Mensch-Maschine-Zusammenarbeit verbessern. Mein Karriereweg wird durch kontinuierliches Lernen und das Streben nach Exzellenz im Systems Engineering geleitet.",
  
  "short_term_goals_title": "Kurzfristig (1-2 Jahre)",
  "short_term_goals_text": "Eine anspruchsvolle Position als Systemingenieur oder Robotikspezialist sichern, in der ich meine technische Expertise anwenden und erweitern kann, während ich zu innovativen Automatisierungslösungen beitrage.",
  
  "mid_term_goals_title": "Mittelfristig (3-5 Jahre)",
  "mid_term_goals_text": "Technische Projekte im Bereich Automatisierung und Robotik leiten, spezialisiertes Fachwissen in KI-gestützten Systemen entwickeln und relevante Zertifizierungen in Projektmanagement und Systems Engineering anstreben.",
  
  "long_term_goals_title": "Langfristig (5+ Jahre)",
  "long_term_goals_text": "Aufstieg in eine leitende technische oder Führungsposition, in der ich strategische Entscheidungen beeinflussen, jüngere Ingenieure mentorieren und zur Festlegung von Industriestandards und Best Practices beitragen kann.",
  
  "projects_title": "Projekterfahrung",
  "projects_filter_all": "Alle Projekte",
  "projects_filter_professional": "Berufserfahrung",
  "projects_filter_school": "Universitätsprojekte",
  
  "skills_simulation_design_title": "Simulation & Design",
  "skills_programming_robotics_title": "Programmierung & Robotik",
  "skills_mbse_quality_title": "MBSE & Qualitätsmanagement",
  "skills_languages_title": "Sprachen",
  "skills_level_proficient": "Sehr gut",
  "skills_level_advanced": "Fortgeschritten",
  "skills_level_intermediate": "Gut",
  "skills_level_basic": "Grundlegend",
  "skills_level_fluent": "Fließend",
  "skills_level_native": "Muttersprache",
  
  "project_card_details_button": "Details anzeigen",
  "project_modal_close_button": "Schließen",
  "project_modal_tools_label": "Eingesetzte Tools & Technologien:",
  "project_modal_result_label": "Ergebnis:",
  "project_video_unavailable": "Video in Kürze verfügbar",
  "project_video_placeholder_text": "Video-Platzhalter",
  "project_modal_show_more": "Mehr anzeigen",
  "project_modal_show_less": "Weniger anzeigen",
  
  "project_sdos_title": "Teamleiter – Safe Door Open System (BMW i3)",
  "project_sdos_period": "10/2023 - 03/2024",
  "project_sdos_description": "Entwicklung eines intelligenten Türöffnungssystems auf Basis von MBSE zur Erhöhung der Verkehrssicherheit. Systemarchitektur-Entwurf in Cameo Systems Modeler gemäß SysML-Standards, inkl. Sensor-, Aktor- und Steuerungskomponenten. Anforderungsmanagement unter Berücksichtigung funktionaler Sicherheit (ASIL, ISO 26262). Koordination eines interdisziplinären Projektteams, Schnittstelle zwischen Mechanik, Software und Validierung.",
  "project_sdos_result": "Kollisionsrisiko mit Radfahrern um ~60 % reduziert, Fehlbedienungswahrscheinlichkeit um ~30 % gesenkt.",
  "project_sdos_category": "school",
  "project_sdos_challenge": "Die Hauptherausforderung bestand darin, mehrere Sensorsysteme zu integrieren und gleichzeitig Echtzeitfähigkeit zu gewährleisten und strenge Automobilsicherheitsstandards (ISO 26262) einzuhalten.",
  "project_sdos_solution": "Implementierung einer modularen Architektur mit redundanten Sicherheitssystemen und Entwicklung eines umfassenden Validierungsrahmens zur Gewährleistung der Zuverlässigkeit unter verschiedenen Umgebungsbedingungen.",
  "project_sdos_tools": "Cameo Systems Modeler, SysML, MATLAB/Simulink, DOORS für Anforderungsmanagement, Git für Versionskontrolle",
  
  "project_ur10e_title": "CAD-Ingenieur – Entwicklung eines Vakuumanschlusses für UR10e",
  "project_ur10e_period": "10/2023 - 03/2024",
  "project_ur10e_description": "Lastoptimiertes Design eines flexiblen Schlauchanschlusses zur Integration in ein kollaboratives Robotersystem. CAD-gestützte Konstruktion des Anschlusses in Fusion 360 & Siemens NX mit Fokus auf Gewichtsverteilung und Montagefreundlichkeit. Iteratives Prototyping mit 3D-Druck und FEM-Analyse zur Validierung mechanischer Belastbarkeit. Schnittstellenkoordination zwischen Roboter, Greifer und Vakuumquelle.",
  "project_ur10e_result": "Drehmomentbelastung um ~40 % reduziert, Bauteillebensdauer um ~25 % erhöht.",
  "project_ur10e_category": "school",
  "project_ur10e_challenge": "Entwicklung einer leichten, aber dennoch haltbaren Verbindung, die den Bewegungsbereich des Roboters nicht beeinträchtigt und gleichzeitig optimalen Vakuumdruck aufrechterhält.",
  "project_ur10e_solution": "Einsatz von Topologieoptimierungstechniken und umfangreichen FEM-Analysen zur Identifizierung der optimalen Materialverteilung. Erstellung eines modularen Designs, das eine einfache Wartung und den Austausch von Verschleißteilen ermöglicht.",
  "project_ur10e_tools": "Fusion 360, Siemens NX, ANSYS für FEM-Analyse, Ultimaker 3D-Drucker für Rapid Prototyping",
  
  "project_vw_factory_title": "Systemingenieur – Virtuelle Fabrik (Volkswagen)",
  "project_vw_factory_period": "04/2023 - 07/2023",
  "project_vw_factory_description": "Digitalisierung und Automatisierung der Motorenproduktion durch virtuelle Modellierung und Prozessoptimierung. Modellierung und Simulation des Produktionslayouts mit Tecnomatix Plant Simulation zur frühzeitigen Erkennung von Engpässen. Analyse und Optimierung der Materialflüsse und Linienführungen zur Reduktion von Taktzeiten. Anwendung von Lean-Methoden zur Prozessvereinfachung (z. B. Wertstromanalyse, PDCA).",
  "project_vw_factory_result": "Produktionskapazität um ~20 % erhöht, Durchlaufzeit um ~30 % reduziert.",
  "project_vw_factory_category": "school",
  "project_vw_factory_challenge": "Erstellung eines präzisen digitalen Zwillings der bestehenden Produktionslinie, der für zuverlässige Simulation und Optimierung genutzt werden konnte, ohne den laufenden Betrieb zu stören.",
  "project_vw_factory_solution": "Entwicklung einer umfassenden Datenerfassungsmethodik und Erstellung eines modularen Simulationsrahmens, der eine schrittweise Validierung und Implementierung von Änderungen ermöglichte.",
  "project_vw_factory_tools": "Tecnomatix Plant Simulation, AutoCAD für Layoutplanung, Microsoft Power BI für Datenvisualisierung, Lean-Management-Tools",
  
  "project_bsh_master_title": "Praktikant (Masterarbeit) – BSH Hausgeräte GmbH",
  "project_bsh_master_period": "10/2024 - BIS JETZT",
  "project_bsh_master_description": "Entwicklung eines vollautomatisierten Testsystems für Waschmaschinen mit >80 % Abdeckung standardisierter Testfälle. Visuelles Erkennungssystem auf Deep-Learning-Basis zur Verbesserung der Fehlererkennung und Prozessautomatisierung. Konstruktion und 3D-Druck neuer Roboterkomponenten zur Erhöhung der Systemstabilität (+50 %). Durchführung umfangreicher Belastungs- und Stresstests zur Validierung des Systems.",
  "project_bsh_master_result": "Masterarbeit: \"Automatisierte Testsysteme mit kollaborativem Roboter und visuellem KI-System\"",
  "project_bsh_master_category": "professional",
  "project_bsh_master_challenge": "Erstellung eines zuverlässigen automatisierten Testsystems, das mit der Variabilität verschiedener Waschmaschinenmodelle umgehen und subtile Qualitätsprobleme genau erkennen kann.",
  "project_bsh_master_solution": "Implementierung eines Deep-Learning-basierten Computer-Vision-Systems, das mit Tausenden von Bildern sowohl defekter als auch fehlerfreier Einheiten trainiert wurde. Entwicklung eines flexiblen Robotersteuerungssystems, das sich an verschiedene Maschinengeometrien anpassen kann.",
  "project_bsh_master_tools": "Python mit TensorFlow und OpenCV für KI-Visionssystem, Universal Robots Programmierinterface, CAD-Tools für Komponentendesign, GitLab CI/CD für kontinuierliche Integration",
  
  "project_haering_bachelor_title": "Praktikant (Bachelorarbeit) – Anton Häring KG",
  "project_haering_bachelor_period": "10/2021 - 06/2022",
  "project_haering_bachelor_description": "Entwicklung eines modularen Software-Frameworks für unterschiedliche Robotersysteme. Optimierung von Ablaufsteuerungen mit Reduktion der Zykluszeit um ~30 %. Entwicklung eines Systems zur aktiven Kollisionsvermeidung (Fehlerquote -70 %). Skalierung auf komplexe Fertigungslinien im Rahmen der Serienproduktion.",
  "project_haering_bachelor_result": "Bachelorarbeit: \"Entwicklung eines Steuerungskonzepts zur automatisierten Maschinenbestückung\"",
  "project_haering_bachelor_category": "professional",
  "project_haering_bachelor_challenge": "Erstellung eines einheitlichen Steuerungsframeworks, das mit verschiedenen Robotermarken und Maschinentypen funktionieren kann und gleichzeitig hohe Leistungs- und Sicherheitsstandards einhält.",
  "project_haering_bachelor_solution": "Entwurf einer Abstraktionsschicht, die die Schnittstelle zwischen verschiedenen Robotersteuerungen standardisierte, und Implementierung eines Echtzeit-Kollisionserkennungs- und -vermeidungssystems unter Verwendung von Näherungssensoren und prädiktiven Algorithmen.",
  "project_haering_bachelor_tools": "KUKA Robot Language (KRL), ABB RAPID, Siemens S7 SPS-Programmierung, Python für Datenanalyse, AutoCAD für Layoutplanung",
  
  "contact_title": "Kontakt",
  "contact_email": "E-Mail",
  "contact_phone": "Telefon",
  "contact_address": "Anschrift",
  "contact_get_in_touch": "Kontakt aufnehmen",
  "contact_intro_text": "Ich bin immer offen für die Diskussion neuer Projekte, kreativer Ideen oder Möglichkeiten, Teil Ihrer Visionen zu werden. Zögern Sie nicht, mich zu kontaktieren.",
  "contact_form_name": "Ihr Name",
  "contact_form_email": "Ihre E-Mail",
  "contact_form_message": "Ihre Nachricht",
  "contact_form_send_button": "Nachricht senden",
  "contact_form_sending": "Wird gesendet...",
  "contact_form_sent_success": "Nachricht erfolgreich gesendet!",
  "contact_form_sent_error": "Nachricht konnte nicht gesendet werden. Bitte versuchen Sie es erneut.",
  "contact_phone_value": "+49 176 XXXXXXXX (Bitte per E-Mail anfragen)",
  "contact_address_value": "Berlin, Deutschland (Vollständige Adresse auf Anfrage)",
  
  "education_msc_degree": "M.Sc. Produktionstechnik - Automatisierungs- und Informationstechnik",
  "education_msc_institution": "Technische Universität Berlin",
  "education_msc_period": "04/2022 - 06/2025 (Voraussichtlich)",
  "education_msc_focus": "Schwerpunkte: Industrielle Virtuelle Technik, Digitale Fabrikbetriebe, Virtuelle Produktentstehungstechnologien",
  "education_msc_thesis": "Masterarbeit: Automatisierung der Waschmaschinenprüfung mittels kollaborativer Roboter und Deep Learning-basierter visueller Erkennung",
  
  "education_beng_mechatronics_degree": "B.Eng. Mechatronik (Doppelabschluss)",
  "education_beng_mechatronics_institution": "Hochschule Merseburg",
  "education_beng_mechatronics_period": "10/2020 - 09/2022",
  "education_beng_mechatronics_focus": "Schwerpunkte: Robotik, Elektromotoren und Antriebstechnik, Mechanische Systeme, Mikroprozessortechnik, Montagetechnik",
  "education_beng_mechatronics_thesis": "Bachelorarbeit: Konzeptualisierung eines Industrieroboterprogramms zur vollautomatischen Be- und Entladung von Werkzeugmaschinen",
  
  "education_beng_mechanical_degree": "B.Eng. Maschinenbau, Fertigung und Automatisierung (Doppelabschluss)",
  "education_beng_mechanical_institution": "Jiangsu University of Technology, China",
  "education_beng_mechanical_period": "09/2017 - 09/2022",
  "education_beng_mechanical_focus": "Schwerpunkte: Technische Mechanik, Maschinenbau, Grundlagen der Steuerungstechnik, Technisches Zeichnen, Materialbearbeitungstechnik",
  "education_beng_mechanical_honors": "Auszeichnungen/Zertifikate: Deutsches Ingenieur-Berufszertifikat, Mehrere Universitätsstipendien",
  "education_focus_label": "Schwerpunkte:",
  "education_thesis_label": "Abschlussarbeit:",
  "education_honors_label": "Auszeichnungen/Zertifikate:",
  
  "footer_copyright": "© 2025 Chenshun Weng. Alle Rechte vorbehalten.",
  "footer_built_with": "Erstellt mit React & Tailwind CSS"
}
